In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]});

In [4]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [5]:
df.loc[df.AAA >= 5, 'BBB'] = -1

In [6]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   -1  -30
3    7   -1  -50

In [7]:
df.loc[df.AAA >=5, ['BBB','CCC']] = -2

In [8]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   -2   -2
2    6   -2   -2
3    7   -2   -2

In [9]:
df.loc[df.AAA < 5, ['BBB','CCC']] = 2000

In [10]:
df

   AAA   BBB   CCC
0    4  2000  2000
1    5    -2    -2
2    6    -2    -2
3    7    -2    -2

In [11]:
df_mask = pd.DataFrame({'AAA' : [True] * 4, 'BBB' : [False] * 4,'CCC' : [True,False] * 2})

In [12]:
df_mask

    AAA    BBB    CCC
0  True  False   True
1  True  False  False
2  True  False   True
3  True  False  False

In [14]:
df.where(df_mask, -1000)

   AAA   BBB   CCC
0    4 -1000  2000
1    5 -1000 -1000
2    6 -1000    -2
3    7 -1000 -1000

In [15]:
df1 = pd.DataFrame({'AAA': [1,2,3,4], 'BBB': [10,20,30,40], 'CCC': [100, 200, 300, 400]})

In [16]:
df1

   AAA  BBB  CCC
0    1   10  100
1    2   20  200
2    3   30  300
3    4   40  400

In [26]:
df_low = df1[df1.AAA <=2]
df_high = df1[df1.AAA > 2]

In [27]:
df_low

   AAA  BBB  CCC
0    1   10  100
1    2   20  200

In [28]:
df_high

   AAA  BBB  CCC
2    3   30  300
3    4   40  400

In [29]:
df2 = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]})

In [30]:
df2

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [38]:
newseries = df2.loc[(df2['BBB'] < 25) & (df2['CCC'] > -40), 'AAA']

In [39]:
newseries

0    4
1    5
Name: AAA, dtype: int64

In [41]:
newseries1 = df.loc[(df['BBB'] > 25) | (df['CCC'] >= -40), 'AAA']

In [42]:
newseries1

0    4
1    5
2    6
3    7
Name: AAA, dtype: int64